{
    "version": "https://jsonfeed.org/version/1",
    "title": "TRANSLATION :: TRANSCREATION :: LOCALIZATION COPYWRITING :: GERMAN TO ENGLISH :: FRENCH TO ENGLISH",
    "description": "",
    "home_page_url": "https://mpt24.com",
    "feed_url": "https://mpt24.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Manko Pie"
    },
    "items": [
        {
            "id": "https://mpt24.com/machine-translation.html",
            "url": "https://mpt24.com/machine-translation.html",
            "title": "Isn&#x27;t machine translation good enough these days?",
            "summary": "Well, it is good for some things. It's good for email exchanges or translating on the fly out of another&hellip;",
            "content_html": "<p>Well, it is good for some things. It's good for email exchanges or translating on the fly out of another language into yours. Situations where all parties concerned know that they will need to work a little to understand what is meant, and where it is acceptable that some things won't be immediately clear (or may even be completely unclear).</p>",
            "image": "https://mpt24.com/media/posts/6/google_translate_example_de-en_16-9.png",
            "author": {
                "name": "Manko Pie"
            },
            "tags": [
            ],
            "date_published": "2022-07-01T18:36:21+02:00",
            "date_modified": "2022-07-04T12:42:17+02:00"
        },
        {
            "id": "https://mpt24.com/what-is-transcreation.html",
            "url": "https://mpt24.com/what-is-transcreation.html",
            "title": "WHAT IS TRANSCREATION?",
            "summary": "Transcreation is a word we hear quite often these days, but maybe the term \"localization copywriting\" is a little more&hellip;",
            "content_html": "<p>Transcreation is a word we hear quite often these days, but maybe the term \"localization copywriting\" is a little more self-explanatory. Call it what you like, it is the process of not just translating text but rewriting a message in another language and, where necessary, adapting it culturally.</p>",
            "image": "https://mpt24.com/media/posts/5/02900_cadaques.JPG",
            "author": {
                "name": "Manko Pie"
            },
            "tags": [
            ],
            "date_published": "2022-07-01T12:28:19+02:00",
            "date_modified": "2022-07-01T12:47:07+02:00"
        },
        {
            "id": "https://mpt24.com/in-einem-zug.html",
            "url": "https://mpt24.com/in-einem-zug.html",
            "title": "Would you translate this as &quot;In a train to Tirol&quot;?",
            "summary": "I have seen this sign many times and always admired the excellent wordplay. As far as I know there is&hellip;",
            "content_html": "<p>I have seen this sign many times and always admired the excellent wordplay. As far as I know there is no English version of this ad, and I don't think there needs to be one. I'm pretty sure it is aimed primarily at German visitors to Tirol in Austria.</p>\n<p>I'm going to try to transcreate it into English anyway, just for fun, and as a quick example of the transcreation process.</p>\n<p>Right. What's the message?<br>- We encourage you to go to Tirol by train instead of by car<br>- You can go directly, even from Germany</p>\n<p>The word-for-word translation \"In a train to Tirol\" is, of course, not a proper translation. It doesn't even transfer one of the two elements of the message contained in the German wordplay. In fact, in English it comes across as no more than a fairly pointless statement. It just hangs in the air. A normal translator might still be tempted to use it though. You can understand why if you remember that regular, jobbing translators are mostly paid per word, and as little per word as the customer or agency can get away with. On top of that, they are usually not provided with the context needed to do a proper job</p>\n<p>It is clear that what makes the message stick in the mind is the excellent wordplay. It reverberates in the mind. Can we find an equivalent in English? Well, although you could translate the German expression \"in einem Zug\" into English as \"in one fell swoop\" or \"(all) in one go\", neither is usable in this context.</p>\n<p>Oh dear.</p>\n<p>If we don't have a wordplay, what can we do instead that would be similar in its effect on the reader?</p>\n<p>We could use a different literary device. Alliteration, for example, rather than wordplay. I have one idea. I don't like it as much as the source, but it would work, and, importantly, it is usable for the intended purpose, and it contains both elements of the message:</p>\n<p>\"Take the train straight to Tirol\"</p>\n<p>Maybe if a driver saw that a few times on a stretch of road (there are several of these ads on billboards placed along certain sections of trunk road), it might start off a brainworm (a brainworm is my own term for something that gets stuck in your head a bit like an earworm, except that it's a phrase rather than a piece of music). Hmm... I'm starting to like it more. If you say it a few times to yourself, the rhythm starts to sound like a train running along the rails.</p>\n<p>It's good to like your own ideas... but not too much!</p>\n<p>If you are from the company Tirol Info, then I would like to say that you have my sincere admiration for a great strapline in German. And although my English version is probably not quite as good, I still claim copyright to it. So if you want to use it, please get in touch first.</p>\n<p>And whoever you are, if you can think of something better, I'd love to know what it is. Just out of interest.</p>\n<p>So, there's a quick and real example of what transcreation is all about. Fun, isn't it?</p>",
            "image": "https://mpt24.com/media/posts/1/in_einem_zug_16-9.png",
            "author": {
                "name": "Manko Pie"
            },
            "tags": [
            ],
            "date_published": "2022-07-01T10:02:16+02:00",
            "date_modified": "2022-07-04T16:15:55+02:00"
        },
        {
            "id": "https://mpt24.com/customers-want-clarity.html",
            "url": "https://mpt24.com/customers-want-clarity.html",
            "title": "Customers don&#x27;t want to work hard trying to figure out what you mean",
            "summary": "Your marketing copy must be crystal clear or it risks being ignored. There are a lot of voices out there&hellip;",
            "content_html": "<p>Your marketing copy must be crystal clear or it risks being ignored. There are a lot of voices out there and if you are trying to sell something you need to grab and hold attention. But you already know that. Of course you do. And I bet you take a lot of care to get the source text right in the original language. That's easy for you to do if the source language is your language. But what about the English translation? Are you sure that you are as sensitive to what might be wrong with that? Be very careful here, because sometimes the translation can look good to you because you recognize each element from the source. BUT, those elements may be completely meaningless in the English-speaking world. In fact, sometimes the translation that looks best to a native speaker of the source language is the hardest to understand for a native speaker of the target language. How can you know what is right?</p>",
            "image": "https://mpt24.com/media/posts/2/alpacas_1920x1080-2.png",
            "author": {
                "name": "Manko Pie"
            },
            "tags": [
            ],
            "date_published": "2022-06-01T10:27:00+02:00",
            "date_modified": "2022-07-04T13:11:31+02:00"
        }
    ]
}
